app/Controllers/ProdukController.php

SELECT *
FROM `product`
---
    public function index()
    {
        $product = $this->product->findAll();

SELECT *
FROM `product`
---
    public function download()
    {
            //get data from database
        $product = $this->product->findAll();